In [12]:
import MySQLdb
import pandas as pd

#使用python连接数据库
conn = MySQLdb.connect(
    host = '127.0.0.1',#本地地址
    user = 'root',#一般默认用户名
    passwd = '',#本地数据库登录密码（这里用你自己的密码！！！）
    db = 'xscj',#数据库名称（这里用你自己的数据库名称！！！）
    port = 3306,#安装mysql默认的端口号
    charset = 'utf8'#设置数据库统一编码
)

## 将sql语句转为DataFrame

In [34]:
sql = 'SELECT * FROM `kc`;'
df = pd.read_sql(sql,conn)
df

DatabaseError: Execution failed on sql: SELECT * FROM `kc`;
(0, '')
unable to rollback

In [28]:
sql2 = 'select * from `kc` where `学时` >= 60 order by `开课学期`;'
df2 = pd.read_sql(sql2,conn)
df2

   课程号      课程名  开课学期  学时  学分
0  101    计算机基础     1  80   5
1  102  程序设计与语言     2  68   4
2  206     离散数学     4  68   4
3  208     数据结构     5  68   4
4  210    计算机原理     5  85   5
5  209     操作系统     6  68   4
6  212    数据库原理     7  68   4

In [27]:
sql1 = 'select * from `kc` where `学分` = 3;'
df1 = pd.read_sql(sql1,conn)
df1

   课程号    课程名  开课学期  学时  学分
0  301  计算机网络     7  51   3
1  302   软件工程     7  51   3

In [32]:
sql3 = 'select `课程号`,`课程名`,`开课学期`,`学分` from `kc` where `课程名` like "%数据%";'
df3 = pd.read_sql(sql3,conn)
df3

   课程号    课程名  开课学期  学分
0  208   数据结构     5   4
1  212  数据库原理     7   4

## 将数据库文件导出成csv

In [33]:
df.to_csv('goods_info.csv', encoding = 'utf-8', index = False)
conn.close()#记得关闭数据库连接